import Image from 'next/image'
import { FC } from 'react'

import styles from './Regulations.module.scss'
import info from '@/../public/images/info.png'

const Regulations: FC = () => {
	return (
		<div className={styles.regulations}>
			<div className={styles.regulations__main} />
			<div className={styles.regulations__content}>
				<h1 className={styles.regulations__heading}>Регламент</h1>
				<div className={styles.regulations__text}>
					<h2 className={styles.regulations__textHeader}>
						1. Загальні положення
					</h2>
					<p>
						1.1. Цей регламент встановлює правила та умови оренди та продажу
						квартир на нашому сайті.
					</p>
					<p>
						1.2. Користувачі, які здійснюють пошук, оренду або купівлю квартир
						на нашому сайті, зобов'язуються дотримуватися цих правил.
					</p>
					<p>
						1.3. Користувачі повинні бути старше 18 років або мати повноваження
						вчиняти операції, пов'язані з орендою або купівлею квартир.
					</p>
					<p>
						1.4. Ми залишаємо за собою право змінювати цей регламент у будь-який
						час без попереднього повідомлення. Будь ласка, періодично
						переглядайте цей документ, щоб бути в курсі останніх змін.
					</p>
					<h2 className={styles.regulations__textHeader}>
						2. Реєстрація користувача
					</h2>
					<p>
						2.1. Для пошуку, оренди або купівлі квартир користувач повинен
						зареєструватися на нашому сайті.
					</p>
					<p>
						2.2. Користувач повинен надати точну та повну інформацію при
						реєстрації. Несправжня інформація або використання чужого
						ідентифікаційного номера можуть призвести до скасування облікового
						запису.
					</p>
					<p>
						2.3. Користувач несе повну відповідальність за безпеку свого паролю
						та облікового запису. У разі втрати або підозри на несанкціонований
						доступ до облікового запису, користувач повинен повідомити нас
						негайно.
					</p>
					<h2 className={styles.regulations__textHeader}>3. Пошук квартир</h2>
					<p>
						3.1. Користувач може використовувати наш пошуковий інструмент для
						знаходження квартир за певними критеріями.
					</p>
					<p>
						3.2. Ми не несемо відповідальності за точність та достовірність
						інформації, наданої орендодавцями або продавцями квартир.
					</p>
					<p>
						3.3. Користувач повинен зв'язатися з орендодавцем або продавцем
						безпосередньо для отримання додаткової інформації, організації
						огляду квартири та узгодження умов оренди або покупки.
					</p>
					<h2 className={styles.regulations__textHeader}>
						4. Оренда та продаж квартир
					</h2>
					<p>
						4.1. Умови оренди та продажу квартир визначаються між користувачем
						та орендодавцем або продавцем.
					</p>
					<p>
						4.2. Ми не беремо участі у встановленні цін, умов оренди або продажу
						квартир. Ми не несемо відповідальності за будь-які угоди, укладені
						між користувачем та орендодавцем або продавцем.
					</p>
					<p>
						4.3. Користувач повинен уважно ознайомитися з умовами оренди або
						продажу квартири та переконатися в їх прийнятності до укладення
						угоди.
					</p>
					<p>
						4.4. Ми рекомендуємо користувачам підписувати письмові угоди про
						оренду або продаж квартир та перевіряти їх правомірність з фахівцем
						з права нерухомості.
					</p>
					<h2 className={styles.regulations__textHeader}>
						5. Відповідальність
					</h2>
					<p>
						5.1. Ми не несемо відповідальності за будь-які збитки, збитки або
						претензії, які виникають внаслідок використання нашого сайту або
						угоди між користувачем та орендодавцем або продавцем.
					</p>
					<p>
						5.2. Користувачі повинні бути обережні та пильні при здійсненні
						оренди або покупки квартир та брати на себе повну відповідальність
						за свої дії.
					</p>
					<p>
						5.3. Ми залишаємо за собою право заблокувати або видалити обліковий
						запис користувача у разі порушення цього регламенту або виявлення
						шахрайських дій.
					</p>
					<p className={styles.regulations__textField}>
						Цей регламент розроблено для забезпечення чесності, безпеки та
						комфорту використання нашого сайту для оренди та продажу квартир.
						Використовуючи наш сайт, ви погоджуєтесь дотримуватися цих правил і
						зробити все можливе, щоб забезпечити успішну та безпечну угоду між
						сторонами.
					</p>
				</div>
				<Image
					src={info}
					alt='My Image'
					className={styles.info__image}
					width={626}
					height={403}
					priority
				></Image>
			</div>
		</div>
	)
}

export default Regulations
